Sweep cannot have a path with ellipse or spline segments and a profile with non-straight lines.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId ComplexPathWithComplexProfile { get; }
  Visual Basic
Public Shared ReadOnly Property ComplexPathWithComplexProfile As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ ComplexPathWithComplexProfile {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SweepFailures Class
  Autodesk.Revit.DB Namespace